const myProjectsTexts = `

## Інші сайти:

## AnimeHub-SPA
Мій **другий опублікований** проєкт. Він представляє собою сайт для **перегляду аніме**, підключений до **Jikan API**.
### Основні відмінності AnimeHub-SPA над AnimeHub-MPA:

- **Архітектура:** AnimeHub-SPA має архітектуру **SPA (1 .html файл)**, а AnimeHub-MPA має ахітектуру **MPA (окремий .html файл для кожноі сторінки)**.
- **Переваги AnimeHub-MPA над AnimeHub-SPA:** SEO просування, автоматизація правильного функціонування системної кнопки "назад", Автоматичне збереження теперішньої сторінки навіть при закритті браузера.
- **Недоліки:** Перезавантаження при переході на іншу сторінку, Більш складна взаємодія між різними сторінками, більше дублювань в коді.

[Перейти на AnimeHub-SPA](https://kingalaluna.github.io/AnimeHub-SPA/)

### AnimeHub-SPA проєкт з відкритим вихідним кодом

[Глянути вихідний код](https://github.com/KingAlaluna/AnimeHub-SPA.git)




## AnimePotik-SPA (АнімеПотік)
Мій **давній** та **перший опублікований** проєкт. Він представляє собою сайт для **перегляду аніме**, підключений до **Jikan API**.
### Основні відмінності AnimeHub-MPA над AnimePotik-SPA:

- **React та додаткові бібліотеки:** AnimeHub-MPA написаний з використанням фреймворка **React** для сучасноі архітектури та бібліотек **Font Awesome** для іконок і **Marked** для транслюваня мови розмітки **Markdown в html**. AnimePotik-SPA написаний на **Vanilla JavaScript**, без використання фреймворків та бібліотек.
- **Інформація:** AnimeHub-MPA крім стандартної інформації про аніме також підтримує **детальну інформацію** про **персонажів** аніме та **акторів/актрис** які озвучували даного персонажа. AnimePotik-SPA підтримує **тільки** стандартну інформацію.
- **Улюблені аніме:** AnimeHub-MPA має можливість **додати аніме** в улюблене, завдяки **localStorage**. AnimePotik-SPA такоі можливості **не має**.
- **Фільтри:** AnimeHub-MPA дозволяє вибирати **декілька фільтрів** одночасно, в залежності від можливостей **Jikan API**. AnimePotik-SPA дозволяє одночасно вибрати **тільки 1** фільтр.
- **Підтримуваність:** AnimeHub-MPA набагато легше **підтримувати та розширювати** ніж AnimePotik-SPA, завдяки сучасним фреймворку **React** та бібліотек **Font Awesome** і **Marked**.

[Перейти на AnimePotik-SPA](https://kingalaluna.github.io/AnimePotik-SPA/)

### AnimePotik-SPA проєкт з відкритим вихідним кодом

[Глянути вихідний код](https://github.com/KingAlaluna/AnimePotik-SPA.git)

## Ігри:

Тут буде коротка інформація та посилання на мої ігри...
`;