const myProjectsTexts = `

## Інші сайти:


## AnimePotik-MPA
Мій **четвертий опублікований** проєкт. Він являє собою сайт для **перегляду аніме**, підключений до **Jikan API**.
### Основні відмінності AnimePotik-MPA від AnimeHub-SPA:

- **Архітектура:** AnimePotik-MPA побудований на архітектурі **MPA** (детальніше про різницю архітектур **читати на AnimeHub-SPA**).
- **Інше:** В іншому AnimePotik-MPA схожий на AnimePotik-SPA (детальніше читати нижче у розділі "AnimePotik-SPA", або переконатися особисто, перейшовши за посиланням нижче).

[Перейти на AnimePotik-MPA](https://kingalaluna.github.io/AnimePotik-MPA/)

### AnimePotik-MPA — проєкт з відкритим вихідним кодом

[Глянути вихідний код](https://github.com/KingAlaluna/AnimePotik-MPA.git)




## AnimeHub-SPA
Мій **другий опублікований** проєкт. Він являє собою сайт для **перегляду аніме**, підключений до **Jikan API**.
### Основні відмінності AnimeHub-SPA від AnimeHub-MPA:

- **Архітектура:** AnimeHub-SPA має архітектуру **SPA (1 .html файл)**, а AnimeHub-MPA має архітектуру **MPA (окремий .html файл для кожної сторінки)**.
- **Переваги AnimeHub-MPA над AnimeHub-SPA:** SEO-просування, автоматизація правильного функціонування системної кнопки "назад", автоматичне збереження поточної сторінки навіть при закритті браузера.
- **Недоліки:** Перезавантаження при переході на іншу сторінку, складніша взаємодія між різними сторінками, більше дублювань у коді.

[Перейти на AnimeHub-SPA](https://kingalaluna.github.io/AnimeHub-SPA/)

### AnimeHub-SPA — проєкт з відкритим вихідним кодом

[Глянути вихідний код](https://github.com/KingAlaluna/AnimeHub-SPA.git)




## AnimePotik-SPA
Мій **давній** та **перший опублікований** проєкт. Він являє собою сайт для **перегляду аніме**, підключений до **Jikan API**.
### Основні переваги AnimeHub-MPA над AnimePotik-SPA:

- **React та додаткові бібліотеки:** AnimeHub-MPA написаний з використанням фреймворку **React** для сучасної архітектури та бібліотек **Font Awesome** для іконок і **Marked** для транслювання мови розмітки **Markdown в HTML**. AnimePotik-SPA написаний на **Vanilla JavaScript**, без використання фреймворків та бібліотек.
- **Інформація:** AnimeHub-MPA, крім стандартної інформації про аніме, також підтримує **детальну інформацію** про **персонажів** аніме та **акторів/актрис**, які озвучували даного персонажа. AnimePotik-SPA підтримує **тільки** стандартну інформацію.
- **Улюблені аніме:** AnimeHub-MPA має можливість **додати аніме** в улюблене завдяки **localStorage**. AnimePotik-SPA такої можливості **не має**.
- **Фільтри:** AnimeHub-MPA дозволяє вибирати **декілька фільтрів** одночасно, залежно від можливостей **Jikan API**. AnimePotik-SPA дозволяє одночасно вибрати **тільки 1** фільтр.
- **Підтримуваність:** AnimeHub-MPA набагато легше **підтримувати та розширювати**, ніж AnimePotik-SPA, завдяки сучасному фреймворку **React** та бібліотекам **Font Awesome** і **Marked**.

[Перейти на AnimePotik-SPA](https://kingalaluna.github.io/AnimePotik-SPA/)

### AnimePotik-SPA — проєкт з відкритим вихідним кодом

[Глянути вихідний код](https://github.com/KingAlaluna/AnimePotik-SPA.git)



## Ігри:

Тут буде коротка інформація та посилання на мої ігри...
`;
